var problemData = [{
		province: '山西',
		problem: [
			['坐落于山西省的全国唯一一座反映八路军抗战历史的大型综合纪念馆，是全国爱国主义教育示范基地，是', '九一八博物馆', '八路军太行纪念馆', '抗日战争纪念馆', '长征纪念馆', 'B'],
			['指挥临汾战役、晋中战役、太原战役，代表作《历史的回顾》的无产阶级革命家是', '林彪', '毛泽东', '徐向前', '周恩来', 'C'],
			['被毛泽东主席题字“生的伟大，死的光荣”的革命英雄是', '刘胡兰', '江姐', '王二小', '方志敏', 'A'],
			['拔除了国民党反动统治在华北的最后堡垒，推动了全中国解放战争的进程的战役是', '淮海战役', '平津战役', '太原解放战役', '辽沈战役', 'C'],
			['百团大战的发生时间是', '1938年', '1939年', '1940年', '1941年', 'C'],
			['由林彪指挥的八路军115师在山西大同对日军的一场伏击战，以八路军获胜告终，是八路军出师以来取得的首次胜利，这场战役是', '平型关战役', '平津战役', '淮海战役', '辽沈战役', 'A']
		]
	},
	{
		province: '吉林',
		problem: [
			['东北的军事重镇，在解放战争期间，这里被外国记者称为“东方马德里”，在此地发生的战役是', '辽沈战役', '淮海战役', '平津战役', '四平战役', 'D'],
			['我党军历史上的一次重要会议，是我军从战略防御转为战略进攻的一次重大转折，历史已证明，这次会议是挽救南满危局的基点是取得胜利保卫临江的前奏，这次会议是', '红船会议', '中国七大', '七道江会议', '遵义会议',
				'C'
			],
			['历任东北财政经济委员会主任、中华全国总工会主席、中共中央书记处书记的是', '邓小平', '陈云', '刘少奇', '江泽民', 'B'],
			['以下哪个是烈士杨靖宇的作品', '《上海屋檐下》', '《谢瑶环》', '《义勇军进行曲》', '《西征胜利歌》', 'D'],
			['新中国成立以来唯一享有朱德题词“人民英雄”殊荣的我军高级将领', '杨靖宇', '张自忠', '李宗仁', '彭德怀', 'A'],
			['四保临江发生的时间', '1921年', '1941年', '1946年', '1949年', 'C']
		]
	},
	{
		province: '黑龙江',
		problem: [
			['“母亲对于你没有能尽到教育的责任，实在是遗憾的事情。母亲因为坚决地做了反满抗日的斗争，今天已经到了牺牲的前夕了。”这是谁所写', '江姐', '赵一曼', '刘胡兰', '朱凡', 'B'],
			['解放后成为新中国第一代钻井工人，被称为“铁人”的', '袁隆平', '焦裕禄', '时传祥', '王进喜', 'D'],
			['《中俄瑷珲条约》签订于', '1840年', '1858年', '1894年', '1900年', 'B'],
			['1928年，反对日本在我国东北修筑五路案，爆发了哪次运动', '哈尔滨学生运动', '五四运动', '五卅运动', '一二九运动', 'A'],
			['八女投江中不包括', '黄桂清', '郭桂琴', '赵一曼', '李凤善', 'C'],
			['《智取威虎山》中的角色，并被评为“侦察英雄”、“战斗模范”的是', '王近山', '江姐', '马骏', '杨子荣', 'D']
		]
	},
	{
		province: '陕西',
		problem: [
			['促成了国共第二次合作的是', '解放战争', '西安事变', '红军长征', '中共八大', 'B'],
			['毛泽东提出了“自己动手，丰衣足食”的口号，动员根据地军民开展大生产运动是在', '袁家村', '井冈山', '南泥湾', '王家坪', 'C'],
			['从土地革命战争时期到抗日战争时期中国共产党召开的哪一次极为重要的会议，目的在于停止内战，建立抗日民族统一战线', '西柏坡会议', '延安整风', '遵义会议', '瓦窑堡会议', 'D'],
			['1953年版第二套人民币二元券正面图案为', '延安宝塔山', '华山', '日月潭', '桂林山水', 'A'],
			['延安精神不包括', '实事求是、理论联系实际的精神服务的精神', '自力更生艰苦奋斗的精神', '打倒日本帝国主义', '全心全意为人民服务', 'C'],
			['“四八”烈士中不包括', '叶挺', '朱德', '秦邦宪', '王若飞', 'B']
		]
	},
	{
		province: '河北',
		problem: [
			['“新中国从这里走来”、“中国命运定于此村”描述的是', '西柏坡', '井冈山', '延安', '北平', 'A'],
			['“铁肩担道义，妙手著文章”形容的是', '郭沫若', '李大钊', '陈独秀', '茅盾', 'B'],
			['在抗日战争时期和日伪军展开神奇的地道战，曾获“抗日模范村”的光荣称号 的是', '冉庄村', '野厂村', '马栏村', '李家瞳村', 'A'],
			['狼牙山五壮士不包括', '马宝玉', '胡德林', '胡福才', '王二小', 'D'],
			['我党创建的第一个敌后抗日根据地，被誉为“敌后模范的抗日根据地及统一战线的模范区”的是', '陕甘宁根据地', '苏南根据地', '晋察冀边区', '晋绥根据地', 'C'],
			['反映了河北革命斗争的光荣历史的作品不包括', '《江姐》', '《青春之歌》', '《小兵张嘎》', '《地道战》', 'A']
		]
	},
	{
		province: '辽宁',
		problem: [
			['日本帝国主义侵华战争的开端，标志着世界反法西斯战争的开始，揭开了第二次世界大战东方战场的序幕的是', '甲午战争', '八国联军侵华', '九一八事变', '七七事变', 'C'],
			['不属于三大战役的是', '平津战役', '辽沈战役', '淮海战役', '百团大战', 'D'],
			['1953年哪个协定的签署标志着抗美援朝的结束', '《何梅协定》', '《朝鲜停战协定》', '《双十协定》', '《马关条约》', 'B'],
			['日本军队实施杀光、烧光、抢光“三光”政策的起点', '平顶山惨案', '七三一部队', '南京大屠杀', '七七事变', 'A'],
			['学雷锋纪念日是', '3月3日', '3月4日', '3月5日', '3月6日', 'C'],
			['领导创建了巴彦抗日游击队，珠河、汤原抗日游击根据地的革命英雄是', '杨子荣', '杨靖宇', '赵一曼', '赵尚志', 'D']
		]
	},
	{
		province: '甘肃',
		problem: [
			['后红军三大主力在哪里的会师，标志着万里长征的胜利结束', '甘肃会宁', '井冈山', '西柏坡', '延安', 'A'],
			['哪次战役的胜利为党中央和红军陕甘支队北上打开了通道', '淮海战役', '辽沈战役', '平津战役', '腊子口战役', 'D'],
			['在高台牺牲的烈士是', '董存瑞', '董振堂', '杨子荣', '杨靖宇', 'B'],
			['八路军的总指挥是', '林彪', '彭德怀', '朱德', '叶挺', 'C']
		]
	},
	{
		province: '青海',
		problem: [
			['中国工农红军西路军纪念馆门前，基座上刻着题词：“红军西路军烈士永远活在我们心中”，这题词出自', '李先念', '毛泽东', '周恩来', '朱德', 'A'],
			['中国工农红军二万五千里长征惟一经过青海的地方是', '青海湖', '红军沟', '澜沧江', '塔尔寺', 'B']
		]
	},
	{
		province: '山东',
		problem: [
			['从属于徐州会战，中国正面战场最大的胜利之一的是', '辽沈战役', '淮海战役', '台儿庄大捷', '平型关大捷', 'C'],
			['以下不属于中国四大革命根据地的是', '井冈山革命根据地', '延安革命根据地', '沂蒙山革命根据地', '晋绥根据地', 'D'],
			['哪场战役打破了国民党军南北夹击的计划，稳定了山东解放区大局，为夺取全国解放积累了宝贵经验', '莱芜战役', '百团大战', '台儿庄大捷', '淮海战役', 'A'],
			['在抗日战争时期，以微山湖为根据地的微湖大队、运河支队、铁道游击队等革命武装，出没在千顷芦苇荡里，活跃于津浦铁路线上，创造了许多可歌可泣的英雄业绩。刘知侠的长篇小说（）即取材于此', '《沂蒙山的故事》', '《红嫂》',
				'《铁道游击队》', '《战地日记》', 'C'
			],
			['解放战争时期，中国人民解放军华东野战军在山东省蒙阴县东南对国民党军进行的进攻作战是', '平津战役', '孟良崮战役', '济南战役', '台儿庄大捷', 'B']
		]
	},
	{
		province: '福建',
		problem: [
			['被誉为人民解放军的“军魂”所在地的是', '嘉兴红船', '古田会议会址', '井冈山革命根据地', '延安会址', 'B'],
			['以下是福州战役主要指挥官的是', '叶飞', '朱德', '叶挺', '彭德怀', 'A'],
			['毛泽东在哪里召集过“六种人调查会”，还主持召开红四军前委扩大会议，制定开辟闽西、赣南革命根据地的战略方针', '西柏坡', '江西瑞金', '辛耕别墅', '井冈山革命根据地', 'C']
		]
	},
	{
		province: '浙江',
		problem: [
			['因为中国共产党第一次全国代表大会在此胜利闭幕，而被称作是中国共产党的摇篮的是', '南湖', '嘉兴', '西湖', '延安', 'A'],
			['鲁迅一生在文学创作、文学批评、思想研究、文学史研究、翻译等多个领域具有重大贡献，以下不属于他的作品的是', '《呐喊》', '《彷徨》', '《狂人日记》', '《子夜》', 'D'],
			['中共一大的召开时间', '1921年6月', '1921年7月', '1921年8月', '1921年9月', 'B']
		]
	},
	{
		province: '河南',
		problem: [
			['中国第一次工人运动高潮的顶点，扩大了党在全国人民中的影响的是', '二七大罢工', '二八大罢工', '五四运动', '五卅运动', 'A'],
			['焦裕禄精神不包括', '亲民爱民', '艰苦奋斗', '科学求实', '勤俭节约', 'D'],
			['石林军事会议的代表人物不包括', '刘伯承', '徐向前', '毛泽东', '邓小平', 'B'],
			['三大战役中解放军牺牲最重、歼敌数量最多、政治影响最大、战争样式最复杂的战役是', '百团大战 ', '辽沈战役', '淮海战役', '平津战役', 'C']
		]
	},
	{
		province: '湖北',
		problem: [
			['第一次国内革命战争失败以后，在关系党和革命事业前途和命运的关键时刻，中共中央政治局于1927年8月7日在汉口召开的紧急会议是', '八七会议', '中共七大', '遵义会议', '中共三大', 'A'],
			['中共一大代表、党的创始人之一，代表作为《五一纪念歌》的是', '陈独秀', '陈潭秋', '瞿秋白', '毛泽东', 'B'],
			['解放战争从战略防御到战略进攻的一个伟大转折', '台儿庄大捷', '挺进大别山', '《双十协定》', '平型关大捷', 'B'],
			['著名抗日将领，民族英雄，在枣宜会战为国捐躯的是', '彭德怀', '李宗仁', '傅作义', '张自忠', 'D']
		]
	},
	{
		province: '湖南',
		problem: [
			['初步形成了农村包围城市的战略思想，成功地走出了一条在农村建立革命根据地的是', '秋收起义', '南昌起义', '广州起义', '井冈山斗争', 'A'],
			['以下起义中，发生在1928年的是', '秋收起义', '南昌起义', '南昌起义', '平江起义', 'D'],
			['在湖南省可参观到的名人故居不包括', '毛泽东故居', '刘少奇故居', '杨开慧故居', '邓小平故居', 'B'],
			['雷锋的作品不包括', '《我学会开拖拉机了》', '《雷锋日记》', '《离开雷锋的日子》', '《茵茵》', 'C']
		]
	},
	{
		province: '江西',
		problem: [
			['中国革命的摇篮是', '井冈山', '瑞金', '南昌', '安源', 'A'],
			['共和国的摇篮是', '井冈山', '瑞金', '南昌', '安源', 'B'],
			['人民军队的摇篮', '井冈山', '瑞金', '南昌', '安源', 'C'],
			['工人运动的摇篮', '井冈山', '瑞金', '南昌', '安源', 'D'],
			['红军长征出发地', '于都', '瑞金', '南昌', '安源', 'A'],
			['他把马克思主义与赣东北实际相结合，创造了一整套建党、建军和建立红色政权的经验，这个人是', '彭德怀', '陈云', '邓小平', '方志敏', 'D']
		]
	},
	{
		province: '江苏',
		problem: [
			['常州三杰不包括', '瞿秋白', '张太雷', '恽代英', '谭秋林', 'D'],
			['抗日战争最后一役是', '高邮战役', '平津战役', '淮海战役', '辽沈战役', 'A'],
			['南京大屠杀的发生时间为', '1937.12.12', '1937.12.13', '1937.12.14', '1937.12.15', 'B'],
			['1938年发生的哪场战役为为武汉保卫战赢得时间', '淮海战役', '辽沈战役', '徐州会战', '平津战役', 'C'],
			['以下不属于瞿秋白作品的是', '《寒夜》', '《多余的话》', '《饿乡纪程》', '《赤都心史》', 'A']
		]
	},
	{
		province: '新疆',
		problem: [
			['1969年6月10日，在反击前苏联入侵巴尔鲁克山西部地区的战斗中，为了保卫祖国领土，捍卫民族尊严，不幸中弹牺牲的新疆女战士是', '江竹筠', '孙龙珍', '秋瑾', '刘胡兰', 'B'],
			['在现存的“八路军办事处旧址纪念馆”中保存最完整、最具代表性的纪念馆位于', '新疆', '西藏', '内蒙古', '广西', 'A']
		]
	},
	{
		province: '西藏',
		problem: [
			['1949年2月初，与来访的苏共中央政治局委员米高扬谈到解放西藏的问题时，谁提出： “不能太快，不能过于鲁莽。”', '邓小平', '毛泽东', '周恩来', '朱德', 'B'],
			['1949年7月8日，西藏地方政府以“防止共产党混迹西藏”为借口，下令将国民政府驻藏办事处人员及相关人员驱赶出西藏，制造了哪起事件', '七八事件', '八七事件', '七一事件', '八一事件', 'A']
		]
	},
	{
		province: '宁夏',
		problem: [
			['以下省份中，红军长征没有途径的是', '闽', '粤', '湘', '鲁', 'D'],
			['在党的历史上具有特殊的贡献和重要地位的陕甘宁边区成立于', '1935年', '1936年', '1937年', '1938年', 'C']
		]
	},
	{
		province: '贵州',
		problem: [
			['遵义会议后红军决定', '北上', '南下', '向东出发', '向西出发', 'A'],
			['长征途中 , 中共历史上具有生死攸关的转折意义的大会', '黎平会议', '遵义会议', '白沙会议', '泸定会议', 'B'],
			['1935 年 1 月，中央红军主力强渡什么天险，占领了遵义', '大渡桥', '金沙江', '乌江', '草地', 'C'],
			['红军长征以来召开的第二次中央政治局会议，为遵义会议的胜利召开奠定了坚实基础和作出最直接的准备，被周恩来誉为“伟大转折的前夜”的是', '八七会议', '猴场会议', '中共七大', '井冈山会议', 'B']
		]
	},
	{
		province: '四川',
		problem: [
			['中央红军北渡金沙江后，在什么地区进行了休整并召开了会议', '攀枝花市', '会东县', '会理县', '宁南县', 'C'],
			['长征路上中央红军翻越的第一座大雪山是', '梦笔山', '夹金山', '昌德山', '达古山', 'B'],
			['飞夺泸定桥，是中国工农红军长征中的一场重要战役，其还有一个别名叫做', '巧渡金沙江', '强渡大渡河', '四渡赤水', '强渡乌江', 'B'],
			['以下不属于中华人民共和国元帅的是', '贺龙', '林彪', '陈毅', '陈赓', 'D']
		]
	},
	{
		province: '安徽',
		problem: [
			['百万雄师渡江第一船登陆点', '马鞍山', '铜陵', '芜湖', '安庆', 'C'],
			['以下是安徽省人的革命家', '王稼祥', '李大钊', '瞿秋白', '习仲勋', 'A'],
			['1941年，《新华日报》上刊出周恩来的亲笔题词，“千古奇冤，江南一叶，同室操戈，相煎何急？！”此题词是为（）而写', '博山惨案', '确山惨案', '皖南事变', '马日事变', 'C'],
			['1915年（）在上海创办了《青年杂志》', '陈独秀', '胡适', '李大钊', '蔡元培', 'A'],
			['以下不是瑶岗渡江战役总前委的是', '邓小平', '刘伯承', '陈毅', '毛泽东', 'D']
		]
	},
	{
		province: '内蒙古',
		problem: [
			['我国最早建立省级少数民族自治区的是', '内蒙古自治区', '新疆维吾尔自治区', '西藏自治区', '宁夏回族自治区', 'A'],
			['周恩来称赞“单刀赴会，一个人解决了一个共和国”的领导人是', '朱德', '乌兰夫', ' 习仲勋', '布赫', 'B'],
			['内蒙古自治区诞生地', '包头', '呼和浩特', '赤峰', '乌兰浩特', 'D'],
			['日本关东军在中国东北地区设置的最大的-试验场在', '巴彦汗', '满洲里', '奈曼旗', '红山', 'A']
		]
	},
	{
		province: '上海',
		problem: [
			['共产党的最早组织是在哪里首先建立的', '上海', '长沙', '武汉', '北京', 'A'],
			['党的一大 二大  四大 都在哪里召开', '上海', '北京', '南京大屠杀', '杭州', 'A'],
			['上海四行仓库抗战纪念馆是为了纪念', '徐州会战', '太原会战', '淞沪会战', '武汉会战', 'C'],
			['新中国第一任上海市市长', '陈毅', '粟裕', '彭德怀 ', '刘伯承', 'A']
		]
	},
	{
		province: '广东',
		problem: [
			['黄花岗起义又称', '广州起义', '韶关起义', '惠州起义', '梅州起义', 'A'],
			['下列哪位英雄的纪念馆位于广东省', '朱德', '叶剑英', '彭德怀', '邓小平', 'B'],
			['黄埔军校是大革命时期（）在中国共产党和苏联的帮助下建立的一所新型军事学校', '林则徐', '叶挺', '孙中山', '林彪', 'C'],
			['三元里斗争是指抗击哪个国家的军队', '法国', '德国', '日本', '英国', 'D']
		]
	},
	{
		province: '澳门',
		problem: [
			['中葡两国对澳门政权交接的时间是', '1999.12.20', '1999.7.1', '1998.12.20', '1998.7.1', 'A']
		]
	},
	{
		province: '北京',
		problem: [
			['一二九运动首先发生在（）', '南京', '上海', '武汉', '北平', 'D'],
			['抗战时期驻扎北京地区第一个中共省级机关（中共冀热察区党委）驻地在', '怀柔区', '密云区', '门头沟区', '房山区', 'C'],
			['新文化运动的主要阵地', '《青年杂志》', '《新青年》', '《新潮》', '《曙光》', 'C'],
			['中华民族全面抗战的起点', '一二八事变', '八一三事变', '九一八事变', '七七事变', 'D'],
			['卢沟桥事变发生于', '1936年', '1937年', '1938年', '1939年', 'B'],
			['天安门广场是记载了中国人民不屈不挠的革命精神和大无畏的英雄气概，天安门广场面积', '42万平方米', '43万平方米', '44万平方米', '45万平方米', 'C'],
			['国内唯一一座全面反映中国人民抗日战争历史的综合纪念馆位于', '南京', '武汉', '北京', '广州', 'C'],
			['1911 年辛亥革命后，中华民国定都南京，（）年，迁都北京', '1912年', '1913年', '1914年', '1915年', 'A']
		]
	},
	{
		province: '云南',
		problem: [
			['石鼓渡口红色旅游景区是当年红军渡（）经过的地方', '岷江', '金沙江', '长江', '澜沧江', 'B'],
			['遵义会议的继续和发展，继遵义会议后的又一重大会议', '白沙会议', '通道会议', '扎西会议', '猴场会议', 'C'],
			['国立西南联合大学不包括', '北京大学', '清华大学', '武汉大学', '南开大学', 'C'],
			['"一二·一"运动，是在中国共产党领导下，由（）青年学生发起并得到全国各地响应的反内战、争民主的爱国民主运动。运动揭露了国民党反动派发动内战的阴谋', '曲靖', '昆明', '玉溪', '丽江', 'B']
		]
	},
	{
		province: '海南',
		problem: [
			['西沙群岛自卫反击战是对入侵的（）军队进行的一次反击作战', '英国', '南越', '印度', '马来西亚', 'B'],
			['海南抗日力量日益壮大的时候，但逃避抗战策划反共的国民党顽固派，竞同日寇勾结合谋，在全琼掀起反共高潮，不断向我抗日根据地进攻，发生了', '平型关战役', '琼崖战斗', '海南岛战役', '大水战斗', 'D']
		]
	},
	{
		province: '广西',
		problem: [
			['国共产党广西前委发动和领导的武装起义不包括', '龙州起义', '百色起义', '南宁兵变', '天福山起义', 'D'],
			['桂南会战国民革命军投入战力最强规模部队的一场战役', '长城战役', '中条山战役', '昆仑关战役', '平型关战役', 'C'],
			['1929年12月11日中国共产党在广西发动的一次成功的武装起义，又被称为右江暴动的是（）', '龙州起义', '百色起义', '南宁兵变', '天福山起义', 'B'],
			['广西农民运动讲习所旧址原名北帝岩，1930年2月，红七军军长张云逸来到武篆，认为韦拔群在北帝岩宣传了马列主义，提议改名为（）', '马列岩', '马克思岩', '列宁岩', '恩格斯岩', 'C']
		]
	},
	{
		province: '天津',
		problem: [
			['周恩来邓颖超纪念馆在', '北京市', '天津市', '济南市', '石家庄', 'B'],
			['战场包括天津的解放战争的战役', '辽沈战役', '平津战役', '淮海战役', '上高会战', 'B'],
			['大沽口战役前后共发生几次战斗', '一次', '二次', '三次', '四次', 'C'],
			['中国共产党在天津的第一个领导机关是', '中共天津临时工作委员会', '中共中央北方局', '中共天津临时省委', '中共天津地方执行委员会', 'D']
		]
	},
	{
		province: '重庆',
		problem: [
			['在中国，缅甸参展的美国飞虎队的指挥官是', '尼米兹', '艾森豪威尔', '陈纳德', '克拉克', 'C'],
			['1945年8月底，毛泽东到重庆与蒋介石进行谈判，即居住在', '江南村', '红岩村', '红渝村', '马草村', 'B'],
			['桂园最初是张治中将军的公馆，1945年国共两党在此谈判，签署了', '国共停战协定', '关于停止国内军事冲突的协定', '双十二协定', '双十协定', 'D'],
			['江姐，罗世文等烈士被关押的牢房是', '青海监狱', '渣滓洞', '息烽集中营', '白公馆', 'B'],
			['下列纪念馆不在重庆的是', '刘伯承同志纪念馆', '邱少云烈士纪念馆', '陈毅故里景区', '聂荣臻元帅陈列馆', 'C']
		]
	},
	{
		province: '香港',
		problem: [
			['香港回归在', '1998.12.20', '1999.12.20', '1999.7.1 ', '1998.7.1', 'C']
		]
	},
	{
		province: '台湾',
		problem: [
			['无', '无', '无', '无', '无', '无']
		]
	}
]
